Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags
The property strip flags enum.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.Name
The name flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.Class
The class flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.Grade
The grade flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.Size
The size flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.BendingRadius
The bending radius flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.Finish
The finish flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.Prefix
The prefix flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.StartNumber
The start number flag.

Tekla.Structures.Model.RebarSetExtensions.PropertyStripFlags.GroupingType
The grouping type flag.